Revit 2027 API
CableSize Methods
The CableSize type exposes the following members.
Methods
Name | Description
Create |  Creates a Cable Size.
Dispose
Duplicate |  Duplicates this Cable Size.
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCableSize |  Gets the Cable Size data by given Cable Size id.
GetCableSizeIdByName |  Gets the Cable Size id by given Cable Size name.
GetCableSizeIds |  Gets all the Cable Size ids in the given document, sorted by name.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CableSize Class
Autodesk.Revit.DB.Electrical Namespace